core/testdata/generalmessagesubscription-request-soap.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header />
<S:Body>
  <ns7:GeneralMessageSubscriptionRequest xmlns:ns2="http://www.siri.org.uk/siri"
                         xmlns:ns3="http://www.ifopt.org.uk/acsb"
                         xmlns:ns4="http://www.ifopt.org.uk/ifopt"
                         xmlns:ns5="http://datex2.eu/schema/2_0RC1/2_0"
                         xmlns:ns6="http://scma/siri" xmlns:ns7="http://wsdl.siri.org.uk">
    <SubscriptionRequestInfo>
      <ns2:RequestTimestamp>2009-11-10T23:00:00.000Z</ns2:RequestTimestamp>
      <ns2:RequestorRef>RATPDEV:Concerto</ns2:RequestorRef>
      <ns2:MessageIdentifier>GMSubscription:Test:0</ns2:MessageIdentifier>
      <ns2:ConsumerAddress>https://edwig-staging.af83.io/test/siri</ns2:ConsumerAddress>
    </SubscriptionRequestInfo>
    <Request version="2.0:FR-IDF-2.4">
      <GeneralMessageSubscriptionRequest>
        <ns2:RequestTimestamp>2009-11-10T23:00:00.000Z</ns2:RequestTimestamp>
        <ns5:SubscriberRef>NINOXE:default</ns5:SubscriberRef>
        <ns5:SubscriptionRef>NINOXE:Subscription::6ba7b814-9dad-11d1-2-00c04fd430c8:LOC</ns5:SubscriptionRef>
        <MessageIdentifier>28679112-9dad-11d1-2-00c04fd430c8</MessageIdentifier>
        <ns5:InitialTerminationTime>2009-11-10T23:00:00.000Z</ns5:InitialTerminationTime>
      </GeneralMessageSubscriptionRequest>
    </Request>
    <RequestExtension />
  </ns7:GeneralMessageSubscriptionRequest>
</S:Body>
</S:Envelope>
